package com.astamatii.javarushexc.javacore.L8.lesson_11;

import java.io.FileReader;
import java.io.IOException;

//Программа запускается с одним параметром - именем файла, который содержит английский текст.
//Посчитать частоту встречания каждого символа.
//Отсортировать результат по возрастанию кода ASCII (почитать в инете).
//
//Пример:
//','=44, 's'=115, 't'=116.
//
//Вывести на консоль отсортированный результат:
//[символ1] частота1
//[символ2] частота2
//Закрыть потоки.
//
//Пример вывода:
//, 19
//- 7
//f 361

public class L7_8_9_IOStreams {
    public static void main(String[] args) {

    }
}
